# Examples:

In [ ]:
Tasks:-
    
1. Read CSV file with mentioned columns only.
2. Read CSV with 5th element only.
3. Check shape , Mean, mode for each column
4. check missing values for each and every column
5. fill the missing values using different methods
6. replace the student names with others.
7. Group the dataset with class, Gender.

1. Read CSV file with mentioned columns only.

In [1]:
import pandas as pd
df= pd.read_csv('student.csv',usecols=["name", "mark"])

In [2]:
df.head(10)

          name  mark
0     John Deo    75
1     Max Ruin    85
2       Arnold    55
3   Krish Star    60
4    John Mike    60
5    Alex John    55
6  My John Rob    78
7       Asruid    85
8      Tes Qry    78
9     Big John    55

2. Read CSV with 5th element only.

In [23]:
def fifth_ele(x):
    if x%5==0:
        return True
    return False

df = pd.read_csv("student.csv",skiprows=lambda x:fifth_ele(x),names=["id","name","class","marks","gender"])

In [24]:
df.head(10)

   id         name  class  marks  gender
0   1     John Deo   Four     75  female
1   2     Max Ruin  Three     85    male
2   3       Arnold  Three     55    male
3   4   Krish Star   Four     60  female
4   6    Alex John   Four     55    male
5   7  My John Rob  Fifth     78    male
6   8       Asruid   Five     85    male
7   9      Tes Qry    Six     78    male
8  11       Ronald    Six     89  female
9  12        Recky    Six     94  female

3. Check shape , Mean, mode for each column

In [41]:
df= pd.read_csv('student.csv')

In [26]:
df.shape

(28, 5)

In [28]:
df.describe()

              id      marks
count  28.000000  28.000000
mean   17.500000  74.642857
std    10.246951  17.103637
min     1.000000  18.000000
25%     8.750000  66.750000
50%    17.500000  78.500000
75%    26.250000  88.000000
max    34.000000  96.000000

4. check missing values for each and every column

In [33]:
df.isnull().sum()

id        0
name      0
class     0
marks     0
gender    0
dtype: int64

5. fill the missing values using different methods

6. replace the student names with others.

In [38]:
df.head()

   id        name  class  marks  gender
0   1    John Deo   Four     75  female
1   2    Max Ruin  Three     85    male
2   3      Arnold  Three     55    male
3   4  Krish Star   Four     60  female
4   6   Alex John   Four     55    male

In [37]:
df.replace(["Arnold","Four"],["Himanshu","Two"])

    id         name  class  marks  gender
0    1     John Deo    Two     75  female
1    2     Max Ruin  Three     85    male
2    3     Himanshu  Three     55    male
3    4   Krish Star    Two     60  female
4    6    Alex John    Two     55    male
5    7  My John Rob  Fifth     78    male
6    8       Asruid   Five     85    male
7    9      Tes Qry    Six     78    male
8   11       Ronald    Six     89  female
9   12        Recky    Six     94  female
10  13          Kty  Seven     88  female
11  14         Bigy  Seven     88  female
12  16        Gimmy    Two     88    male
13  17        Tumyu    Six     54    male
14  18        Honny   Five     75    male
15  19        Tinny   Nine     18    male
16  21   Babby John    Two     69  female
17  22       Reggid  Seven     55  female
18  23        Herod  Eight     79    male
19  24    Tiddy Now  Seven     78    male
20  26       Crelea  Seven     79    male
21  27     Big Nose  Three     81  female
22  28    Rojj Base  Seven     86  female
23  29  Tess Played  Seven     55    male
24  31  Marry Toeey    Two     88    male
25  32    Binn Rott  Seven     90  female
26  33    Kenn Rein    Six     96  female
27  34     Gain Toe  Seven     69    male

7. Group the dataset with class, Gender.

In [42]:
df.head()

   id        name  class  mark  gender
0   1    John Deo   Four    75  female
1   2    Max Ruin  Three    85    male
2   3      Arnold  Three    55    male
3   4  Krish Star   Four    60  female
4   5   John Mike   Four    60  female

In [48]:
grp=df.groupby(['class','gender'])

In [49]:
for name,name_id in grp:
    print(name)
    print(name_id)

('Eight', 'male')
    id   name  class  mark gender
22  23  Herod  Eight    79   male
('Fifth', 'male')
   id         name  class  mark gender
6   7  My John Rob  Fifth    78   male
('Five', 'male')
    id    name class  mark gender
7    8  Asruid  Five    85   male
17  18   Honny  Five    75   male
('Four', 'female')
    id        name class  mark  gender
0    1    John Deo  Four    75  female
3    4  Krish Star  Four    60  female
4    5   John Mike  Four    60  female
9   10    Big John  Four    55  female
20  21  Babby John  Four    69  female
('Four', 'male')
    id         name class  mark gender
5    6    Alex John  Four    55   male
14  15     Tade Row  Four    88   male
15  16        Gimmy  Four    88   male
30  31  Marry Toeey  Four    88   male
('Nine', 'female')
    id    name class  mark  gender
19  20  Jackly  Nine    65  female
('Nine', 'male')
    id   name class  mark gender
18  19  Tinny  Nine    18   male
('Seven', 'female')
    id       name  class  mark  gender
12  13        Kty  Seven    88  female
13  14       Bigy  Seven    88  female
21  22     Reggid  Seven    55  female
27  28  Rojj Base  Seven    86  female
31  32  Binn Rott  Seven    90  female
('Seven', 'male')
    id         name  class  mark gender
23  24    Tiddy Now  Seven    78   male
24  25     Giff Tow  Seven    88   male
25  26       Crelea  Seven    79   male
28  29  Tess Played  Seven    55   male
33  34     Gain Toe  Seven    69   male
('Six', 'female')
    id        name class  mark  gender
10  11      Ronald   Six    89  female
11  12       Recky   Six    94  female
29  30   Reppy Red   Six    79  female
32  33   Kenn Rein   Six    96  female
34  35  Rows Noump   Six    88  female
('Six', 'male')
    id     name class  mark gender
8    9  Tes Qry   Six    78   male
16  17    Tumyu   Six    54   male
('Three', 'female')
    id      name  class  mark  gender
26  27  Big Nose  Three    81  female
('Three', 'male')
   id      name  class  mark gender
1   2  Max Ruin  Three    85   male
2   3    Arnold  Three    55   male

In [7]:
s1= pd.Series([11,12,3,4])
print(s1>7)

0     True
1     True
2    False
3    False
dtype: bool

In [6]:
print(s1[s1>7])
if s1>7:
    True
else:
    False

0    11
1    12
dtype: int64

# Questions:

In [ ]:
1. # How to convert the first character of each element in a series to uppercase?
ser = pd.Series(['how', 'to', 'kick', 'football?'])

2. #. How to calculate the number of characters in each word in a series?c
ser = pd.Series(['how', 'to', 'kick', 'football?'])

3.#. How to compute difference of differences between consequtive numbers of a series?
ser = pd.Series([1, 3, 6, 10, 15, 21, 27, 35])

In [3]:
ser = pd.Series(['how', 'to', 'kick', 'football?'])
print(ser.str.title())

0          How
1           To
2         Kick
3    Football?
dtype: object

In [1]:
# How to convert the first character of each element in a series to uppercase?
ser = pd.Series(['how', 'to', 'kick', 'ass?'])
str(ser.values).title()
for i in range (4):
    ser[i]=str(ser[i]).title()
ser
#ser.map(lambda x: x.title())

0     How
1      To
2    Kick
3    Ass?
dtype: object

In [2]:
ser.map(lambda x: x.title())

0     How
1      To
2    Kick
3    Ass?
dtype: object

In [ ]:
#. How to calculate the number of characters in each word in a series?c
ser = pd.Series(['how', 'to', 'kick', 'ass?'])
ser.map(lambda x: len(str(x)))

In [ ]:
#. How to compute difference of differences between consequtive numbers of a series?
ser = pd.Series([1, 3, 6, 10, 15, 21, 27, 35])
(ser.diff().diff()).tolist()